src/Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Минута</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Час</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/Периодичность/Ext/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

// Функция - Получить представление даты по периодичности.
//
// Параметры:
//  Периодичность	 - 	 - 
//  Дата			 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьПредставлениеДатыПоПериодичности(Периодичность, Дата) Экспорт
	
	Если Периодичность = Перечисления.Периодичность.Час Тогда 
		Возврат Формат(Дата, "ДФ=ЧЧ:мм");
	ИначеЕсли Периодичность = Перечисления.Периодичность.День Тогда
		Возврат Формат(Дата, "ДФ='д ММММ'");
	ИначеЕсли Периодичность = Перечисления.Периодичность.Месяц Тогда
		Возврат Формат(Дата, "ДФ='ММММ гггг'");
	ИначеЕсли Периодичность = Перечисления.Периодичность.Год Тогда
		Возврат Формат(Дата, "ДФ=гггг");
	КонецЕсли;	
	
КонецФункции 

#КонецОбласти
